sterentev/atdf-device-asm-include/inc/ATtiny441.inc
; ----------	Register DIDR1 bits		------------------------
.equ	ADC9D		= 3		; 0x08 - ADC9 Digital Input Disable
.equ	ADC8D		= 2		; 0x04 - ADC8 Digital input Disable
.equ	ADC10D		= 1		; 0x02 - ADC10 Digital input Disable
.equ	ADC11D		= 0		; 0x01 - ADC11 Digital input Disable

; ----------	Register DIDR0 bits		------------------------
.equ	ADC7D		= 7		; 0x80 - ADC7 Digital input Disable
.equ	ADC6D		= 6		; 0x40 - ADC6 Digital input Disable
.equ	ADC5D		= 5		; 0x20 - ADC5 Digital input Disable
.equ	ADC4D		= 4		; 0x10 - ADC4/AIN11 Digital input Disable
.equ	ADC3D		= 3		; 0x08 - ADC3/AIN10 Digital Input Disable
.equ	ADC2D		= 2		; 0x04 - ADC2/AIN01 Digital input Disable
.equ	ADC1D		= 1		; 0x02 - ADC1/AIN00 Digital input Disable
.equ	ADC0D		= 0		; 0x01 - ADC0/AREF Digital input Disable



; ====	AC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ACSR0B bits		------------------------
.equ	HSEL0		= 7		; 0x80 - Analog Comparator 0 Hysteresis Select
.equ	HLEV0		= 6		; 0x40 - Analog Comparator 0 Hysteresis Level
.equ	ACOE0		= 4		; 0x10 - Analog Comparator 0 Output Pin Enable
.equ	ACNMUX_MASK	= 0x0C		;      - Analog Comparator 0 Negative Input Multiplexer (2 bits)
.equ	ACNMUX0		= 2		;          ACNMUX BIT0 position
.equ	ACPMUX_MASK	= 0x03		;      - Analog Comparator 0 Positive Input Multiplexer Bits 1:0 (2 bits)
.equ	ACPMUX0		= 0		;          ACPMUX BIT0 position

; ----------	Register ACSR0A bits		------------------------
.equ	ACD0		= 7		; 0x80 - Analog Comparator 0 Disable
.equ	ACPMUX2		= 6		; 0x40 - Analog Comparator 0 Positive Input Multiplexer Bit 2
.equ	ACO0		= 5		; 0x20 - Analog Comparator 0 Output
.equ	ACI0		= 4		; 0x10 - Analog Comparator 0 Interrupt Flag
.equ	ACIE0		= 3		; 0x08 - Analog Comparator 0 Interrupt Enable
.equ	ACIC0		= 2		; 0x04 - Analog Comparator 0 Input Capture Enable
.equ	ACIS0_MASK	= 0x03		;      - Analog Comparator 0 Interrupt Mode Select bits (2 bits)
.equ	ACIS00		= 0		;          ACIS0 BIT0 position
; ::::  ACIS0	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x01		; Reserved
;			0x02		; Interrupt on Falling Edge
;			0x03		; Interrupt on Rising Edge

; ----------	Register ACSR1B bits		------------------------
.equ	HSEL1		= 7		; 0x80 - Analog Comparator 1 Hysteresis Select
.equ	HLEV1		= 6		; 0x40 - Analog Comparator 1 Hysteresis Level
.equ	ACOE1		= 4		; 0x10 - Analog Comparator 1 Output Pin Enable
.equ	ACME1		= 2		; 0x04 - Analog Comparator 1 Multiplexer Enable

; ----------	Register ACSR1A bits		------------------------
.equ	ACD1		= 7		; 0x80 - Analog Comparator 1 Disable
.equ	ACBG1		= 6		; 0x40 - Analog Comparator 1 Bandgap Select
.equ	ACO1		= 5		; 0x20 - Analog Comparator 1 Output
.equ	ACI1		= 4		; 0x10 - Analog Comparator 1 Interrupt Flag
.equ	ACIE1		= 3		; 0x08 - Analog Comparator 1 Interrupt Enable
.equ	ACIC1		= 2		; 0x04 - Analog Comparator 1 Input Capture Enable
.equ	ACIS1_MASK	= 0x03		;      - Analog Comparator 1 Interrupt Mode Select bits (2 bits)
.equ	ACIS10		= 0		;          ACIS1 BIT0 position
; ::::  ACIS1	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x01		; Reserved
;			0x02		; Interrupt on Falling Edge
;			0x03		; Interrupt on Rising Edge



; ====	EEPROM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EECR bits		------------------------
.equ	EEPM_MASK	= 0x30		;      - EEPROM Programming Mode Bits (2 bits)
.equ	EEPM0		= 4		;          EEPM BIT0 position
.equ	EERIE		= 3		; 0x08 - EEPROM Ready Interrupt Enable
.equ	EEMPE		= 2		; 0x04 - EEPROM Master Write Enable
.equ	EEPE		= 1		; 0x02 - EEPROM Write Enable
.equ	EERE		= 0		; 0x01 - EEPROM Read Enable
; ::::  EEPM	:::: bitfield values
;			0x00		; Erase and Write in one operation
;			0x10		; Erase Only
;			0x20		; Write Only



; ====	TC16 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TIMSK1 bits		------------------------
.equ	ICIE1		= 5		; 0x20 - Timer/Counter1 Input Capture Interrupt Enable
.equ	OCIE1B		= 2		; 0x04 - Timer/Counter1 Output Compare B Match Interrupt Enable
.equ	OCIE1A		= 1		; 0x02 - Timer/Counter1 Output Compare A Match Interrupt Enable
.equ	TOIE1		= 0		; 0x01 - Timer/Counter1 Overflow Interrupt Enable

; ----------	Register TIFR1 bits		------------------------
.equ	ICF1		= 5		; 0x20 - Timer/Counter1 Input Capture Flag
.equ	OCF1B		= 2		; 0x04 - Timer/Counter1 Output Compare B Match Flag
.equ	OCF1A		= 1		; 0x02 - Timer/Counter1 Output Compare A Match Flag
.equ	TOV1		= 0		; 0x01 - Timer/Counter1 Overflow Flag

; ----------	Register TCCR1A bits		------------------------
.equ	COM1A_MASK	= 0xC0		;      - Compare Output Mode 1A, bits (2 bits)
.equ	COM1A0		= 6		;          COM1A BIT0 position
.equ	COM1B_MASK	= 0x30		;      - Compare Output Mode 1B, bits (2 bits)
.equ	COM1B0		= 4		;          COM1B BIT0 position
.equ	TCCR1A_WGM1_MASK= 0x03		;      - Pulse Width Modulator Select Bits (2 bits)
.equ	TCCR1A_WGM10	= 0		;          TCCR1A_WGM1 BIT0 position

; ----------	Register TCCR1B bits		------------------------
.equ	ICNC1		= 7		; 0x80 - Input Capture 1 Noise Canceler
.equ	ICES1		= 6		; 0x40 - Input Capture 1 Edge Select
.equ	TCCR1B_WGM1_MASK= 0x18		;      - Waveform Generation Mode Bits (2 bits)
.equ	TCCR1B_WGM10	= 3		;          TCCR1B_WGM1 BIT0 position
.equ	CS1_MASK	= 0x07		;      - Clock Select bits (3 bits)
.equ	CS10		= 0		;          CS1 BIT0 position
; ::::  CS1	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register TCCR1C bits		------------------------
.equ	FOC1A		= 7		; 0x80 - Force Output Compare for Channel A
.equ	FOC1B		= 6		; 0x40 - Force Output Compare for Channel B

; ----------	Register GTCCR bits		------------------------
.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
.equ	PSR		= 0		; 0x01 - Prescaler Reset Timer/CounterN

; ----------	Register TIMSK2 bits		------------------------
.equ	ICIE2		= 5		; 0x20 - Timer/Counter2 Input Capture Interrupt Enable
.equ	OCIE2B		= 2		; 0x04 - Timer/Counter2 Output Compare B Match Interrupt Enable
.equ	OCIE2A		= 1		; 0x02 - Timer/Counter2 Output Compare A Match Interrupt Enable
.equ	TOIE2		= 0		; 0x01 - Timer/Counter2 Overflow Interrupt Enable

; ----------	Register TIFR2 bits		------------------------
.equ	ICF2		= 5		; 0x20 - Timer/Counter2 Input Capture Flag
.equ	OCF2B		= 2		; 0x04 - Timer/Counter2 Output Compare B Match Flag
.equ	OCF2A		= 1		; 0x02 - Timer/Counter2 Output Compare A Match Flag
.equ	TOV2		= 0		; 0x01 - Timer/Counter2 Overflow Flag

